# Задача 2.
# Посчитать четные и нечетные цифры введенного натурального числа.
# Например, если введено число 34560, в нем 3 четные цифры (4, 6 и 0) и 2 нечетные (3 и 5).
num = int(input("Введите любое число: "))
a = 0
str1 = ''
str2 = ''
while num != 0:
    a = num % 10
    num = num // 10
    if (a % 2) == 0:
        str1 += str(a)
    else:
        str2 += str(a)
print(f'Количество четных цифр во введенном числе: {len(str1)}.')
print(f'Количество нечетных цифр во введенном числе: {len(str2)}.')
