# Задача 3.
# Сформировать из введенного числа обратное по порядку входящих в него цифр и вывести на экран.
# Например, если введено число 3486, надо вывести 6843.
def inversion(num):
    s = ''
    while num != 0:
        s += str(num % 10)
        num = num // 10
    return s
print(inversion(int(input('Введите натуральное число: '))))
