# Задача 1.
# Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
a = int(input("Введите число 5: "))
b = int(input("Введите число 6: "))
bit_or = a | b
bit_and = a & b
bit_xor = a ^ b
left = a << 2
right = a >> 2
print(f"Оператор 'И': {bit_and}\n"
      f"Оператор 'ИЛИ': {bit_or}\n"
      f"Оператор 'исключающее ИЛИ': {bit_xor}\n"
      f"Сдвиг числа 5 на 2 знака влево: {left}\n"
      f"Сдвиг числа 5 на 2 знака вправо: {right}")