# Задача 4.
# Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,…
# Количество элементов (n) вводится с клавиатуры.

def sum(a):
    n = 1
    l = 1
    while a != 0:
        a -= 1
        n = n / (-2)
        l += (n)
    return l
print(sum(int(input("Введите целое  цисло: "))))
