# Задача 5.
# В массиве найти максимальный отрицательный элемент. Вывести на экран его значение и позицию в массиве.
# Примечание к задаче: пожалуйста не путайте «минимальный» и «максимальный отрицательный».
# Это два абсолютно разных значения.
import random

array = [random.randint(-20, 20) for i in range(20)]
print(array)

l = [el for el in array if el < 0]
n = l[0]
for elem in l:
    if elem >= n:
        n = elem

print(f'Максимальный отрицательный элемент: {n}. Индекс: {array.index(n)}.')



