# Задача 8.
# Вводятся три разных числа.
# Найти, какое из них является средним (больше одного, но меньше другого).
print("Введите три разных целых числа: ")
x = int(input("Введите первое число: "))
y = int(input("Введите второе число: "))
z = int(input("Введите третье число: "))
if z < x < y or y < x < z:
    print("Cреднее число: ", x)
elif z < y < x or x < y < z:
    print("Cреднее число: ", y)
else:
    print("Cреднее число: ", z)


