# Задача 7.
# Определить, является ли год, который ввел пользователь, високосным или не високосным.
year = int(input("Пожалуйста, введите год запроса: "))
if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
         print("Високосный год")
else:
         print("Не високосный год")
