# Задача 3.
# Массив размером 2m + 1, где m — натуральное число, заполнен случайным образом.
# Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на две равные части:
# в одной находятся элементы, которые не меньше медианы, в другой — не больше медианы.
# Примечание: задачу можно решить без сортировки исходного массива. Но если это слишком сложно, используйте метод
# сортировки, который не рассматривался на уроках (сортировка слиянием также недопустима).

import random

m = 12
size = 2 * m + 1
arr = [random.randint(1, 50) for i in range(size)]
print(arr)
double = [el for el in arr if arr.count(el) > 1]
f = [arr.count(el) for el in double]
l = list(set(arr))
l_1 = []
for el in l:
    if el in double:
        l_1.extend([double[double.index(el)]]*f[double.index(el)])
    else:
        l_1.append(el)
med = l_1[len(l_1) // 2]
print(f'Медиана: {med}.')

